{
  "task_id": "task-20260129-2144",
  "task_description": "Implement a BM25F multi-field query parser for Apache Lucene. BM25F extends BM25 to score across multiple fields with field-specific weights, combining field-level statistics for improved relevance ranking. The implementation leverages the existing CombinedFieldQuery class which already implements BM25F-style scoring. The new BM25FQueryParser will parse query strings and produce CombinedFieldQuery instances that aggregate term frequencies across configured fields with weights.",
  "status": "in_progress",
  "settings": {
    "target_branch": "main",
    "create_pr": true
  },
  "features": [
    {
      "id": "FEAT-001",
      "category": "Core Parser Implementation",
      "description": "Create BM25FQueryParser class - a multi-field query parser that produces CombinedFieldQuery instances for BM25F scoring",
      "priority": 1,
      "status": "completed",
      "repository": "lucene",
      "steps": [
        "Create package org.apache.lucene.queryparser.bm25f with package-info.java",
        "Implement BM25FQueryParser class extending QueryBuilder for text analysis",
        "Support configuration of field names with weights via Map<String, Float>",
        "Support k1 and b parameters (will use searcher's configured similarity)",
        "Implement parse(String queryText) method returning Query",
        "For single-term queries: produce CombinedFieldQuery",
        "For multi-term queries: produce BooleanQuery of CombinedFieldQueries (one per term)",
        "Support default boolean operator (AND/OR) configuration",
        "Add comprehensive Javadoc documentation following Lucene standards"
      ]
    },
    {
      "id": "FEAT-002",
      "category": "Query Operators Support",
      "description": "Implement standard query operators in BM25FQueryParser for feature parity with SimpleQueryParser",
      "priority": 2,
      "status": "pending",
      "repository": "lucene",
      "steps": [
        "Implement AND operator (+) for required terms",
        "Implement OR operator (|) for optional terms",
        "Implement NOT operator (-) for prohibited terms",
        "Implement phrase operator (\") for exact phrase matching - note: phrase queries fall back to BooleanQuery since CombinedFieldQuery is term-based",
        "Implement grouping with parentheses for precedence control",
        "Implement escape operator (\\) for special characters",
        "Support whitespace as term delimiter"
      ]
    },
    {
      "id": "FEAT-003",
      "category": "Module Integration",
      "description": "Integrate BM25FQueryParser into Lucene's queryparser module",
      "priority": 3,
      "status": "pending",
      "repository": "lucene",
      "steps": [
        "Update lucene/queryparser/src/java/module-info.java to export org.apache.lucene.queryparser.bm25f package",
        "Verify dependencies on lucene.core module (for CombinedFieldQuery) are satisfied",
        "Ensure proper Apache License headers on all new files"
      ]
    },
    {
      "id": "FEAT-004",
      "category": "Unit Tests",
      "description": "Create comprehensive unit tests for BM25FQueryParser",
      "priority": 4,
      "status": "pending",
      "repository": "lucene",
      "steps": [
        "Create TestBM25FQueryParser test class in lucene/queryparser/src/test/org/apache/lucene/queryparser/bm25f/",
        "Test single-term query parsing produces CombinedFieldQuery",
        "Test multi-term query parsing produces BooleanQuery of CombinedFieldQueries",
        "Test field weights are correctly applied",
        "Test AND/OR/NOT operators work correctly",
        "Test phrase queries work correctly (falling back to BooleanQuery)",
        "Test grouping and precedence",
        "Test edge cases: empty query, whitespace-only, special characters",
        "Test integration with actual index search to verify scoring behavior matches BM25F expectations"
      ]
    },
    {
      "id": "FEAT-005",
      "category": "Documentation",
      "description": "Add documentation and usage examples for BM25FQueryParser",
      "priority": 5,
      "status": "pending",
      "repository": "lucene",
      "steps": [
        "Add detailed Javadoc to BM25FQueryParser with usage examples",
        "Document the relationship with CombinedFieldQuery and BM25F scoring",
        "Document supported query syntax and operators",
        "Document configuration options (fields, weights, default operator)",
        "Add code examples showing typical usage patterns"
      ]
    }
  ],
  "assumptions": [
    "The implementation will use the existing CombinedFieldQuery from lucene-core module for BM25F-style scoring",
    "For phrase queries, the parser will fall back to standard phrase matching since CombinedFieldQuery is designed for single-term queries",
    "Field weights must be >= 1.0 as required by CombinedFieldQuery",
    "The parser follows SimpleQueryParser's approach of being fault-tolerant and attempting to parse even malformed queries",
    "The k1 and b parameters are controlled via the IndexSearcher's configured BM25Similarity, not the parser"
  ]
}
